In [1]:
import psycopg2
import os
from dotenv import load_dotenv
import numpy as np
import pandas as pd

In [2]:
# Загрузить переменные окружения

load_dotenv()

# Получить переменную окружения
db_name = os.getenv("DB_NAME")
db_user = os.getenv("DB_USER")
db_password = os.getenv("DB_PASSWORD")
db_host = os.getenv("DB_HOST")
db_port = os.getenv("DB_PORT")

In [3]:
connection = psycopg2.connect(
    database=db_name, user=db_user, password=db_password, host=db_host, port=db_port
)
cursor = connection.cursor()

In [4]:
df = pd.read_sql(
    """SELECT * FROM "user" LIMIT 10 """,
    con=f"postgresql://{db_user}:{db_password}@"
        f"{db_host}:{db_port}/{db_name}"
)

df

,id,gender,age,country,city,exp_group,os,source
0,1,Male,38,Guernsey,South Jeffreymouth,3,iOS,gonzalez.com
1,2,Female,33,Saint Lucia,Ashleybury,1,iOS,powell.biz
2,3,Male,30,Vanuatu,Davidton,3,Windows,lam.net
3,4,Female,51,Singapore,South Ashley,1,Windows,lozano-anderson.com
4,5,Male,45,Slovenia,Alexisberg,0,Windows,marsh.biz
5,6,Male,45,Japan,Stanleyview,0,Android,hodges.com
6,7,Male,30,Iceland,East Michaelville,1,Android,lewis.com
7,8,Female,41,Uganda,Davisberg,1,Windows,rodriguez-campos.org
8,9,Female,45,Maldives,East Jonathanside,3,iOS,robinson-murphy.com
9,10,Male,43,Iraq,South Alexberg,2,iOS,fernandez.com

In [5]:
df = pd.read_sql('''
SELECT * FROM post;
''',connection)
df

/tmp/ipykernel_42068/996451875.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql('''

      id                                               text       topic
0      1  Sort people key. Professor laugh worry artist....         leg
1      2  Class game stay do machine institution.\nWhile...     officer
2      3  Alone choose program increase world society.\n...        foot
3      4  Yeah price health trade could strong. Clearly ...        work
4      5  Why world late. Stay ball eight nice beyond no...  generation
..   ...                                                ...         ...
245  246  Mother avoid health husband Republican interes...  individual
246  247  Computer federal answer particular decision do...         son
247  248  However agree inside manage. Teach within occu...       worry
248  249  Boy next deep indicate simply politics buildin...         key
249  250  Behavior ask professional sister family save s...         low

[250 rows x 3 columns]

In [6]:
t = df['topic'].values
l = ""
for i in t:
    if len(i)>len(l):
        l = i
print(len(t),l)

250 administration

In [7]:
df = pd.read_sql('''SELECT * FROM "user" AS u
                    WHERE u.age > 30 AND u.os = 'iOS';
                 ''',connection)
print(df['id'].values[0], df['city'].values[0])

1 South Jeffreymouth

/tmp/ipykernel_42068/1600272196.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql('''SELECT * FROM "user" AS u

In [8]:
df = pd.read_sql('''
SELECT * FROM "user" as u
WHERE u.exp_group <> 3 AND u.exp_group <> 0 AND u.city = 'South Ashley' AND COUNTRY !='Russia';
''',
connection)
df

/tmp/ipykernel_42068/103286596.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql('''

,id,gender,age,country,city,exp_group,os,source
0,4,Female,51,Singapore,South Ashley,1,Windows,lozano-anderson.com

In [9]:
df = pd.read_sql('''
SELECT age, country FROM "user" as u
WHERE country = 'Japan';
''',
connection)
np.around(df['age'].mean(),2)

/tmp/ipykernel_42068/3885211706.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql('''

np.float64(49.33)

In [10]:
df = pd.read_sql('''
SELECT exp_group, os, COUNT(*), MIN(age), MAX(age) FROM "user" 
GROUP BY exp_group, os
ORDER BY "user".exp_group;
                 
''',connection)
df = df.to_csv('./csv_group_by_1.csv',sep=',', header=['exp_group','os','total_users','min_age','max_age'])
pd.read_csv('./csv_group_by_1.csv')

/tmp/ipykernel_42068/3088059918.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql('''

    Unnamed: 0  exp_group       os  total_users  min_age  max_age
0            0          0  Android           38       23       60
1            1          0      iOS           36       21       59
2            2          0  Windows           43       18       60
3            3          1      iOS           43       18       60
4            4          1  Windows           41       19       58
5            5          1  Android           41       18       60
6            6          2  Android           46       18       60
7            7          2  Windows           34       18       59
8            8          2      iOS           47       18       60
9            9          3      iOS           43       21       59
10          10          3  Windows           50       19       60
11          11          3  Android           38       18       58

In [11]:
df = pd.read_sql('''
SELECT topic, MAX(LENGTH(text)) FROM post
GROUP BY topic
''',connection)
df

/tmp/ipykernel_42068/2001499091.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql('''

        topic  max
0         age   72
1       again  160
2      effort  163
3     concern  185
4         son  148
..        ...  ...
214     after  107
215   prevent  194
216  activity  187
217      news  171
218      else  150

[219 rows x 2 columns]

In [12]:
df = pd.read_sql('''SELECT country, COUNT(*) as c FROM "user" AS u
                    GROUP BY country 
                    HAVING COUNT(*) > 3 
''',connection)
df

/tmp/ipykernel_42068/3538815549.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql('''SELECT country, COUNT(*) as c FROM "user" AS u

                   country  c
0                Indonesia  4
1                 Kiribati  4
2                 Cambodia  5
3         Papua New Guinea  4
4                Singapore  4
5               San Marino  6
6           Cayman Islands  4
7                  Tokelau  5
8               Cape Verde  4
9                  Iceland  4
10            Sierra Leone  6
11                  Turkey  4
12                 Comoros  4
13        Saint Barthelemy  5
14       Wallis and Futuna  4
15              Montserrat  5
16                Thailand  4
17                    Niue  4
18                Barbados  5
19               Argentina  4
20                Slovenia  4
21                   India  5
22             Timor-Leste  4
23                    Peru  6
24              Mozambique  4
25                  Brazil  6
26                Ethiopia  4
27            Turkmenistan  6
28  Libyan Arab Jamahiriya  4
29                 Myanmar  5
30               Nicaragua  7
31                  Guyana  4
32                   Tonga  4
33                  Poland  7
34                  Jersey  4
35                 Andorra  4

In [13]:
df = pd.read_sql('''SELECT country, exp_group, COUNT(id)
FROM "user"
GROUP BY country, exp_group;
''',connection)
df

/tmp/ipykernel_42068/1330726539.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql('''SELECT country, exp_group, COUNT(id)

              country  exp_group  count
0           Indonesia          3      1
1         Puerto Rico          2      2
2               India          0      1
3               Benin          3      1
4          Mozambique          1      1
..                ...        ...    ...
378  French Polynesia          3      1
379           Eritrea          3      1
380            Tuvalu          0      1
381          Slovenia          3      1
382              Iraq          0      1

[383 rows x 3 columns]

In [14]:
df = pd.read_sql('''
SELECT * FROM "user" 
WHERE city = 'Davisberg'
''', connection)
df

/tmp/ipykernel_42068/1605592633.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql('''

,id,gender,age,country,city,exp_group,os,source
0,8,Female,41,Uganda,Davisberg,1,Windows,rodriguez-campos.org

In [15]:
df = pd.read_sql('''SELECT topic, COUNT(*) FROM post
                    GROUP BY topic
                    ORDER BY COUNT(*) DESC
                    LIMIT 3;  
                ''',connection)
df

/tmp/ipykernel_42068/2080583341.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql('''SELECT topic, COUNT(*) FROM post

   topic  count
0   fund      3
1  cover      3
2  value      3

In [16]:
df = pd.read_sql('''SELECT id,age, exp_group,COUNT(*)  FROM "user"
                    where country = 'Poland'
                    GROUP BY id,age, exp_group
                    ORDER BY age DESC, exp_group ASC
                ''',connection)
df['id'][2]

/tmp/ipykernel_42068/158732818.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql('''SELECT id,age, exp_group,COUNT(*)  FROM "user"

np.int64(361)

In [17]:
df = pd.read_sql('''
SELECT u.id , f.user_id, p.id, f.post_id , f.time , u.os, u.age FROM "user" u 
JOIN feed_action f ON u.id = f.user_id
JOIN post p on p.id = f.user_id
ORDER BY f.time
''',connection)
df

/tmp/ipykernel_42068/3882976520.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql('''

     id  user_id  id  post_id                       time       os  age
0     4        4   4       47 2024-01-01 01:25:34.678305  Windows   51
1     8        8   8       45 2024-01-01 02:34:56.177620  Windows   41
2    33       33  33       17 2024-01-01 05:51:09.023381  Windows   27
3    64       64  64       24 2024-01-01 09:37:56.759130      iOS   42
4    27       27  27       41 2024-01-01 14:00:21.432849      iOS   42
..   ..      ...  ..      ...                        ...      ...  ...
995  32       32  32       14 2024-10-10 02:54:51.023879  Windows   53
996  31       31  31       17 2024-10-10 18:25:35.963682  Windows   46
997  43       43  43       13 2024-10-11 02:07:05.020539  Android   49
998  21       21  21        4 2024-10-11 10:01:36.602371  Android   36
999  31       31  31       34 2024-10-11 14:44:47.003165  Windows   46

[1000 rows x 7 columns]

In [18]:
df = pd.read_sql('''
SELECT f.post_id, COUNT(f.action), MAX(f.time) AS c FROM post p
JOIN feed_action f on p.id = f.post_id
GROUP BY f.post_id
ORDER BY c DESC;
''',connection)
df

/tmp/ipykernel_42068/2543332372.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql('''

    post_id  count                          c
0        34     20 2024-10-11 14:44:47.003165
1         4     22 2024-10-11 10:01:36.602371
2        13     23 2024-10-11 02:07:05.020539
3        17     24 2024-10-10 18:25:35.963682
4        14     29 2024-10-10 02:54:51.023879
5        49     15 2024-10-10 00:54:24.632685
6        27     23 2024-10-09 17:14:30.131902
7        39     18 2024-10-09 16:16:48.365351
8        42     17 2024-10-09 13:27:49.645449
9        48     15 2024-10-09 10:30:07.695489
10       10     32 2024-10-08 20:10:54.551522
11       43     27 2024-10-08 01:25:18.138262
12       23     11 2024-10-06 15:55:28.439353
13        7     23 2024-10-06 12:45:39.138641
14        8     24 2024-10-06 06:43:45.671992
15       19     18 2024-10-06 02:07:04.593977
16       32     20 2024-10-04 16:21:15.648235
17       22     28 2024-10-04 16:13:55.326769
18       11     24 2024-10-03 15:58:00.002466
19       45     14 2024-10-03 06:05:20.774514
20       25     23 2024-10-03 04:17:00.810699
21       16     19 2024-10-03 02:09:44.036426
22       47     18 2024-10-02 18:29:42.085912
23       12     15 2024-10-02 13:51:57.840019
24       20     17 2024-10-02 12:41:10.978227
25       37     28 2024-09-30 12:14:17.812462
26       26     20 2024-09-30 07:34:17.033937
27        5     23 2024-09-28 23:22:34.338585
28        3     12 2024-09-27 00:29:41.911489
29       35     20 2024-09-25 21:54:49.630513
30       30     16 2024-09-24 22:54:16.483789
31       46     11 2024-09-23 23:25:54.838023
32       33      8 2024-09-22 19:58:55.114083
33       38     20 2024-09-21 19:17:19.399688
34       21     22 2024-09-21 12:49:22.710457
35       41     18 2024-09-20 11:23:44.971584
36       50     23 2024-09-18 01:50:52.062473
37       40     25 2024-09-17 00:50:23.978191
38       28     22 2024-09-13 09:10:41.395833
39        1     23 2024-09-10 17:31:26.758240
40       18     24 2024-09-09 06:04:56.011115
41       44     24 2024-09-09 04:52:19.021505
42       31     29 2024-09-08 23:13:47.805590
43       36     13 2024-09-07 13:16:48.786509
44        6     20 2024-09-03 11:27:57.603321
45        9     14 2024-08-31 00:09:11.606200
46       15     12 2024-08-22 15:17:53.942125
47        2     17 2024-08-12 15:07:14.094857
48       24     17 2024-08-12 09:48:54.626257
49       29     20 2024-08-06 03:17:48.027689